---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Dispose
source: html/1ac1a866-279d-41c2-696f-8a53e1a08645.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.Dispose Method

Releases all resources used by the MEPAnalyticalSegment

## Syntax (C#)
```csharp
public void Dispose()
```